"""
[기능]

- 예외 처리
- 모든 코드는 함수로 구현될 것
    - docstring은 간단하게 1줄로
    - 매개변수 어노테이션 할 것
        - 예:
            
            ```python
            def plus(x: int, y: int) -> int:
            	return x + y
            ```
            
    - 의도가 불분명한 부분에 주석달 것
    - 함수명, 매개변수명 주의
- 의사코드 작성하지 말 것

[스타일]

- 나머지 객체는 (예: 클래스) 자유롭게 선택하여 쓸 것.
- 프로그램은  `main()`에서 돌리고, 중간 테스트 출력물은 파일3에서 보여줄 것
- 파일 2가 파일 1을 활용할 것
- 테스크는 창의적으로, 원하는 순서대로 접근해도 무관합니다 (요구된 기능이 제대로 구현된다는 전제하에)
- 가이드라인에 제시되지 않은 예외적인 상황(예: 단어 음절과 시조에 정해진 음절을 모두 충족하는 단어가 없다)은 각자 로직을 세워 코드를 작성합니다.
"""